#pragma once

#include "global.h"
#include "types.h"

#include "System/SysNew.hpp"

class ModelRender : public SysObject {
    /* 00 (vtable) */
    /* 04 */ u32 mUnk_04;
    /* 08 */ void *mLcdcAddr;
    /* 0c */ s32 mUnk_0c;
    /* 10 */ unk32 mUnk_10;
    /* 14 */ s32 mUnk_14;
    /* 18 */ unk32 mUnk_18;
    /* 1c */ s32 mUnk_1c;
    /* 20 */ unk8 mUnk_20[0x38];
    /* 58 */ void *mUnk_58;
    /* 5c */
};
