#pragma once

#include "global.h"
#include "types.h"

#include "System/SysNew.hpp"

class Course_Unk_c8 : public SysObject {
public:
    /* 00 */ unk32 mUnk_00;
    /* 04 */ unk32 mUnk_04;
    /* 08 */ unk32 mUnk_08;
    /* 0c */ unk8 mUnk_0c;
    /* 0d */ unk8 mUnk_0d[3];
    /* 10 */ void *mUnk_10;
    /* 14 */ s32 mUnk_14;
    /* 18 */ u32 mUnk_18;
    /* 1c */
};
