#pragma once

#include "global.h"
#include "types.h"

#include <nds/math.h>

struct UnkStruct_027e037c {
public:
    /* 000 */ unk32 mUnk_000;
    /* 004 */ unk32 mUnk_004;
    /* 008 */ Mat4p mUnk_008;
    /* 048 */ unk32 mUnk_048;
    /* 04c */ Mat4x3p mUnk_04c;
    /* 07c */ unk32 mUnk_07c;
    /* 080 */ unk32 mUnk_080;
    /* 084 */ unk32 mUnk_084;
    /* 088 */ unk32 mUnk_088;
    /* 08c */ unk32 mUnk_08c;
    /* 090 */ unk32 mUnk_090;
    /* 094 */ unk32 mUnk_094;
    /* 098 */ unk32 mUnk_098;
    /* 09c */ unk32 mUnk_09c;
    /* 0a0 */ unk32 mUnk_0a0;
    /* 0a4 */ unk32 mUnk_0a4;
    /* 0a8 */ unk32 mUnk_0a8;
    /* 0ac */ unk32 mUnk_0ac;
    /* 0b0 */ unk32 mUnk_0b0;
    /* 0b4 */ unk32 mUnk_0b4;
    /* 0b8 */ unk32 mUnk_0b8;
    /* 0bc */ Mat3p rotation;
    /* 0e0 */ Vec3p translation;
    /* 0ec */ Vec3p scale;
    /* 0f8 */ unk32 mUnk_0f8;
    /* 0fc */ u32 flags;
    /* 100 */ Mat4x3p mUnk_100;
    /* 130 */ Mat4x3p mUnk_130;
    /* 160 */ Mat4x3p mUnk_160;
    /* 190 */ Mat4x3p mUnk_190;
    /* 1c0 */
};

extern UnkStruct_027e037c data_027e037c;
