#pragma once

#include "types.h"

struct UnkStruct_027e1098 {
    /* 00 */ unk8 mUnk_00[0x38];
    /* 38 */ unk32 mUnk_38;
    /* 3c */ unk32 mUnk_3c;
    /* 40 */ unk32 mUnk_40;
    /* 44 */ unk32 mUnk_44;
    /* 48 */ unk8 mUnk_48;
    /* 49 */ unk8 mUnk_49;
    /* 4a */ unk8 mUnk_4a;
    /* 4b */ unk8 mUnk_4b;
    /* 4c */ unk32 mUnk_4c;
    /* 50 */

    void func_ov014_0211fd04();
};

extern UnkStruct_027e1098 *data_027e1098;
