#pragma once

#include "global.h"
#include "types.h"

#include "Debug/DebugHierarchyBase.hpp"

struct UnkStruct_027e0c68 {
    /* 00 */ unk8 mUnk_00[4];
    /* 04 */ u8 mUnk_04;
    /* 05 */ unk8 mUnk_05[3];
    /* 08 */ unk32 mUnk_08;
    /* 0c */ unk8 mUnk_0c[4];
    /* 10 */ unk16 mUnk_10;
    /* 12 */ unk8 mUnk_12[2];
    /* 14 */ unk32 mUnk_14;
    /* 18 */ s32 mUnk_18;
    /* 1c */ s32 mUnk_1c;
    /* 20 */ s32 *mUnk_20;
    /* 24 */ unk32 mUnk_24;
    /* 28 */ s32 *mUnk_28;
    /* 2c */ unk8 mUnk_2c[0x1c];
    /* 48 */ DebugHierarchyBase *mDebug;
    /* 4c */
};

extern UnkStruct_027e0c68 data_027e0c68;
