// TODO: Make sure every function has either ARM or THUMB
// TODO: Optimise functions' bodies as much as possible (without affecting asm)
// Clear these comments when done

#include "Map/MapManager.hpp"
#include "Actor/Actor.hpp"
#include "Actor/ActorManager.hpp"
#include "Actor/ActorSpawner.hpp"
#include "DTCM/UnkStruct_027e077c.hpp"
#include "DTCM/UnkStruct_027e0c68.hpp"
#include "DTCM/UnkStruct_027e0d38.hpp"
#include "DTCM/UnkStruct_027e0f64.hpp"
#include "DTCM/UnkStruct_027e0f6c.hpp"
#include "DTCM/UnkStruct_027e0f78.hpp"
#include "DTCM/UnkStruct_027e0fd4.hpp"
#include "DTCM/UnkStruct_027e103c.hpp"
#include "Message/MessageManager.hpp"
#include "Message/MsgProc.hpp"
#include "Player/PlayerBase.hpp"
#include "Save/AdventureFlags.hpp"
#include "Unknown/UnkStruct_02037750.hpp"
#include "Unknown/UnkStruct_020eec68.hpp"

#include <stdio.h>

extern bool func_01ffbe78(Vec3p *param1, Vec3p *param2, Vec3p *param3, Vec4p *param4);

extern u32 func_ov000_02078bc4(unk32 param_1);
extern s32 func_ov000_02078fe8(s32 *param_1);
extern void func_ov000_0207920c(s32 *param_1, Vec3p *param_2, s32 *param_3, s32 *param_4);
extern void func_ov000_020792a0(s32 *param_1, s32 param_2, unk32 param_3, unk32 param_4);
extern void func_ov000_02079898(unk32 *param_1, unk32 param_2, unk32 param_3);
extern void func_ov000_020798bc(s32 *param_1, s32 param_2);
extern void func_ov000_02088000(UnkStruct_027e0f64_04 *param_1, s32 param_2);
extern void func_ov000_02088130(u8 *param_1, unk32 param_2);
extern void func_ov000_02088144(u8 *param_1, unk32 param_2);

extern s32 func_ov000_0208b73c(s32 param_1, unk32 param_2);
extern s32 func_ov000_0208b7d0(s32 param_1, Vec3p *param_2);
extern s32 func_ov000_0208b804(s32 *param_1, Vec3p *param_2, Vec3p *param_3);
extern s32 func_ov000_0208df78(s32 *param_1, unk32 param_, unk32 param_3, Vec3p *param_4, s32 *param_5);
extern void func_ov000_0208e6b0(Vec3p *param_1, Vec3p *param_2);
extern s32 func_ov000_0208e6f0(Vec3p *param_1);
extern s32 func_ov000_0208e704(Vec3p *param_1);
extern s32 func_ov000_0208e87c(AABB *param_1, Vec3p *param_2, Vec3p *param_3);
extern void func_ov000_0208ed74(AABB *param_1, Vec3p *param_2);
extern void func_ov000_02093a1c(u32 *param_1, unk32 *param_2, unk32 param_3);
extern void func_ov000_02096324(unk32 *param_1, unk32 *param_2);
extern s32 *func_ov000_02096418(s32 *param_1);
extern void func_ov015_021849a4(unk32 *param_1);

// extern MapBase *func_ov018_0215b4a0(MapBase *param_1, unk32 param_2, unk32 param_3);

struct astruct_16 {
    /* 00 */ Actor_UnkStruct_020 *mUnk_00;
    /* 04 */ unk8 mUnk_08[0x10];
    /* 14 */ unk16 mAngle;
    /* 16 */ unk8 mUnk_16;
    /* 17 */ unk8 mUnk_17;
    /* 18 */ unk32 mUnk_18;
    /* 1c */ unk32 mUnk_1c;
    /* 20 */ unk32 mUnk_20;
    /* 24 */ unk32 mUnk_24;
    /* 28 */ unk32 mUnk_28;
    /* 2c */
}; // What is this struct?

class UnkStruct_0212b358 : public MapBase {
public:
    char pad[0x790 - 0x1B0];
    UnkStruct_0212b358(u32 param1, u32 param2);
    virtual ~UnkStruct_0212b358() override;
};

class UnkStruct_02128dd8 : public MapBase {
public:
    UnkStruct_02128dd8(u32 param1, u32 param2);
    virtual ~UnkStruct_02128dd8() override;
};

class UnkStruct_0215b4a0 : public MapBase {
public:
    char pad[0x1DC - 0x1B0];
    UnkStruct_0215b4a0(u32 param1, u32 param2);
    virtual ~UnkStruct_0215b4a0() override;
};

class UnkStruct_0215b4e8 : public MapBase {
public:
    char pad[0x790 - 0x1B0];
    UnkStruct_0215b4e8(u32 param1, u32 param2);
    virtual ~UnkStruct_0215b4e8() override;
};

struct UnkStruct_02084740 {
    /* 00 */ unk32 mUnk_00[0x6c];
    /* 68 */
};

class UnkStruct_02085594 {
public:
    /* 00 */ unk32 mUnk_00;
    /* 04 */ Vec3p mUnk_04;
    /* 10 */ unk32 mUnk_10;
    /* 14 */ Vec3p mUnk_14;
    /* 20 */ unk32 mUnk_20;

    virtual void vfunc_00();
    virtual void vfunc_04();
    virtual void vfunc_08();
    virtual void vfunc_0c();
    virtual void vfunc_10();
    virtual void vfunc_14();
    virtual void vfunc_18();
    virtual unk8 vfunc_1c();
    virtual void vfunc_20();
    virtual void vfunc_24();
    virtual void vfunc_28();
    virtual void vfunc_2c();
    virtual unk32 vfunc_30(unk32 param_2);
    virtual void vfunc_34();
    virtual unk32 vfunc_38(unk32 param_2);
    virtual unk32 vfunc_3c(unk32 param_2);
};

struct UnkStruct_027e0f68 {
    void func_ov000_0208cc88();
    void func_ov000_0208d620();
    void func_ov000_0208d680();
    void func_ov004_02102b28();
};

extern u32 *data_027e0ce0[];
extern UnkStruct_0202e894 *data_027e0ce4;
extern unk32 *data_027e0d3c;
extern UnkStruct_027e0f68 *data_027e0f68;
extern unk32 *data_027e0f70;
extern unk32 data_ov000_020e24b4;
extern unk32 data_ov015_02190458;

